name: "personaplex_pipeline"
platform: "ensemble"
max_batch_size: 0

input [
  { name: "INPUT_PCM"              data_type: TYPE_FP32   dims: [1, 1, 1920] },
  { name: "CORRID"                 data_type: TYPE_INT64  dims: [1] },
  { name: "START"                  data_type: TYPE_FP32   dims: [1] },
  { name: "END"                    data_type: TYPE_FP32   dims: [1] },
  { name: "VOICE_PROMPT_BYTES"     data_type: TYPE_BYTES  dims: [1] },
  { name: "TEXT_PROMPT_TOKENS"     data_type: TYPE_INT32  dims: [-1] }
]

output [
  { name: "OUTPUT_PCM_48K"  data_type: TYPE_FP32   dims: [1, 1, 3840] },
  { name: "TEXT_TOKEN"       data_type: TYPE_INT32  dims: [1] },
  { name: "SESSION_READY"   data_type: TYPE_BOOL   dims: [1] }
]

ensemble_scheduling {
  step [
    {
      model_name: "mimi_encoder"
      model_version: -1
      input_map  { key: "INPUT_PCM"   value: "INPUT_PCM" }
      input_map  { key: "CORRID"      value: "CORRID" }
      input_map  { key: "START"       value: "START" }
      input_map  { key: "END"         value: "END" }
      output_map { key: "CODES"       value: "pipe_codes" }
    },
    {
      model_name: "personaplex_lm"
      model_version: -1
      input_map  { key: "CODES"                value: "pipe_codes" }
      input_map  { key: "CORRID"               value: "CORRID" }
      input_map  { key: "START"                value: "START" }
      input_map  { key: "END"                  value: "END" }
      input_map  { key: "VOICE_PROMPT_BYTES"   value: "VOICE_PROMPT_BYTES" }
      input_map  { key: "TEXT_PROMPT_TOKENS"   value: "TEXT_PROMPT_TOKENS" }
      output_map { key: "TOKENS"               value: "pipe_tokens" }
      output_map { key: "TEXT_TOKEN"           value: "TEXT_TOKEN" }
      output_map { key: "SESSION_READY"        value: "SESSION_READY" }
    },
    {
      model_name: "mimi_decoder"
      model_version: -1
      input_map  { key: "TOKENS"   value: "pipe_tokens" }
      input_map  { key: "CORRID"   value: "CORRID" }
      input_map  { key: "START"    value: "START" }
      input_map  { key: "END"      value: "END" }
      output_map { key: "PCM_24K" value: "pipe_pcm_24k" }
    },
    {
      model_name: "lavasr_v2"
      model_version: -1
      input_map  { key: "PCM_24K"      value: "pipe_pcm_24k" }
      output_map { key: "OUTPUT_PCM_48K" value: "OUTPUT_PCM_48K" }
    }
  ]
}
