name: "personaplex_pipeline"
backend: "python"
max_batch_size: 0

input [
  { name: "INPUT_PCM"              data_type: TYPE_FP32   dims: [1, 1, 1920] },
  { name: "CORRID"                 data_type: TYPE_INT64  dims: [1] },
  { name: "START"                  data_type: TYPE_FP32   dims: [1] },
  { name: "END"                    data_type: TYPE_FP32   dims: [1] },
  { name: "VOICE_PROMPT_BYTES"     data_type: TYPE_STRING dims: [1] },
  { name: "TEXT_PROMPT_TOKENS"     data_type: TYPE_INT32  dims: [-1] }
]

output [
  { name: "OUTPUT_PCM_48K"  data_type: TYPE_FP32   dims: [1, 1, -1] },
  { name: "TEXT_TOKEN"       data_type: TYPE_INT32  dims: [1] },
  { name: "SESSION_READY"   data_type: TYPE_BOOL   dims: [1] }
]

sequence_batching {
  max_sequence_idle_microseconds: 300000000
  control_input [
    {
      name: "START"
      control [ { kind: CONTROL_SEQUENCE_START fp32_false_true: [0, 1] } ]
    },
    {
      name: "END"
      control [ { kind: CONTROL_SEQUENCE_END fp32_false_true: [0, 1] } ]
    },
    {
      name: "CORRID"
      control [ { kind: CONTROL_SEQUENCE_CORRID data_type: TYPE_INT64 } ]
    }
  ]
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
    gpus: [0]
    rate_limiter {
      # Priority 1 = highest.  PP is scheduled before brain.
      # No resource mutex: brain chunked generation (8 tok/call + 200ms
      # sleep) creates natural GPU idle windows.  During sleep, brain
      # launches zero CUDA kernels -> PP gets full GPU bandwidth.
      priority: 1
    }
  }
]
